1. **Добавление нового проекта**: `/new_project`
2. **Просмотр списка проектов**: `/projects`
3. **Обновление данных о проекте**: `/update_projects`
4. **Привязка навыков к проекту**: `/skills`
5. **Удаление проекта**: `/delete`
6. **Получение информации о проекте**: ввод имени проекта.
7. **Просмотр справки по командам**: `/info`

## Основные зависимости
Для работы бота используются следующие библиотеки:
- `sqlite3`: для работы с базой данных.
- `telebot`: для взаимодействия с Telegram API.

## Установка
1. Клонируйте репозиторий:
   ```bash
   git clone https://github.com/z3tttt/portfolio.git
